[
    {
        "id": 1,
        "name": "NUCLEAR NACHO",
        "description": "So spicy it should be illegal. Government warning: may cause taste bud meltdown. This isn't just heat - it's a full-scale flavor detonation that'll leave your mouth in ruins (in the best way possible).",
        "image": "images/product1.jpg",
        "price": 3.99,
        "heatLevel": 5,
        "ingredients": "Potatoes, Nuclear Chili Blend, Artificial Nacho Dust, Capsaicin Crystals, Flavor Grenade Shrapnel, Sodium Overload",
        "crunchFactor": 10
    },
    {
        "id": 2,
        "name": "SOUR BLAST",
        "description": "Face-twisting sour with an explosive fruity finish. Not for the weak-jawed. One bite and you'll experience the full force of our patented Sour Shockwave Technology™.",
        "image": "images/product2.jpg",
        "price": 3.99,
        "heatLevel": 1,
        "ingredients": "Potatoes, Citric Acid Storm, Artificial Fruit Tornado, Sour Shock Powder, Jawbreaker Particles, Tastebud Assault Formula",
        "crunchFactor": 9
    },
    {
        "id": 3,
        "name": "BBQ INFERNO",
        "description": "Smoky, sweet, and with a kick that'll leave you breathless. Proceed with caution. Our BBQ rub is crafted from actual smoke from burning flavor barriers.",
        "image": "images/product3.jpg",
        "price": 3.99,
        "heatLevel": 4,
        "ingredients": "Potatoes, Smoked Paprika Apocalypse, Molasses Lava, Chili Fire Dust, Hickory Ash, Brown Sugar Napalm",
        "crunchFactor": 8
    },
    {
        "id": 4,
        "name": "CHEESE QUAKE",
        "description": "The cheesiest crunch known to humankind. Warning: may cause addiction. Our cheese powder is scientifically engineered to maximum umami impact.",
        "image": "images/product4.jpg",
        "price": 3.99,
        "heatLevel": 2,
        "ingredients": "Potatoes, Artificial Cheese Earthquake, Dairy Tsunami Powder, Umami Bomb, Cheddar Shockwave, Nacho Seismic Charge",
        "crunchFactor": 7
    },
    {
        "id": 5,
        "name": "WASABI REAPER",
        "description": "Japanese heat meets Carolina pain. Only for true flavor warriors. This fusion creates a heat profile that attacks your sinuses first, then your tongue, then your soul.",
        "image": "images/product5.jpg",
        "price": 3.99,
        "heatLevel": 5,
        "ingredients": "Potatoes, Wasabi Grenade, Carolina Reaper Dust, Sinus Destroyer XT, Horseradish Mortar, Ghost Pepper Shards",
        "crunchFactor": 10
    },
    {
        "id": 6,
        "name": "SWEET CHILI THUNDER",
        "description": "Sweet meets heat in this flavor storm. Comes with a satisfaction guarantee. The perfect balance that'll make you question all other sweet chili snacks.",
        "image": "images/product6.jpg",
        "price": 3.99,
        "heatLevel": 3,
        "ingredients": "Potatoes, Sweet Chili Lightning, Garlic Thunder Powder, Sugar Storm, Vinegar Tsunami, Red Pepper Bolt",
        "crunchFactor": 8
    }
]